update readme diagrams
